<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
    <key>Description</key>
    <string>Downloads latest Lendo Phone Client DMG.</string>
    <key>Identifier</key>
    <string>com.github.autopkg.astrom.download.LendoPhoneapp.recipe</string>
    <key>Input</key>
    <dict>
        <key>NAME</key>
        <string>lendo.dmg</string>
        <key>DOWNLOAD_URL</key>
        <string>https://144.63.6.40:8080/apps/lendo.dmg</string>
    </dict>
    <key>MinimumVersion</key>
    <string>0.2.0</string>
    <key>Process</key>
    <array>
        <dict>
            <key>Processor</key>
            <string>URLDownloader</string>
            <key>Arguments</key>
            <dict>
                <key>url</key>
                <string>%DOWNLOAD_URL%</string>
			</dict>
        </dict>
        <dict>
            <key>Processor</key>
            <string>EndOfCheckPhase</string>
        </dict>
    </array>
</dict>
</plist>
